<?php
//$a=23;
//$b=23.0;
//if($a>$b){
//	echo '$a>$b';
//}
//if($a<$b){
//	echo '$a<$b';
//}
//if($a==$b){
//	echo '$a==$b';
//}

//$a=4;
//$b=4.0;
//var_dump($a,$b);
//if($a==$b){
//	echo '<br>$a==$b';
//}
//if($a===$b){
//	echo '$a===$b';
//}

//$a=56;
//$b=90;
//$a-=34;     //$a=22
//$b%=$a;     //$b=90%22=2
//echo $b;    //$b=2
//echo '<br>'.$a;  //$a=22

$a=5;
$b=$a++;
echo $b;    //$b为5,分解为 $b=$a;然后$a再自增,$a的自增和$b没关系
echo '<br>'.$a; //$a自增了,所以这里这里$a=6

$a=56;
$b=$a++;     //等价于 $b=$a;$a=$a+1;后++:先赋值,再自增!
echo $b;     //结果为57.
echo '<br>'.$a.'<br>';
$b=++$a;     //等价于 $a=$a+1;$b=$a;
echo $b;     //结果为57.
echo '<br>'.$a;